[Killed] BlockStatement
src/shopping-list/shopping-list.service.ts:18:58
     private readonly pantryService: PantryService
   ) {}
 
-  async findAll(userId: string): Promise<ShoppingList[]> {
-    return this.shoppingListRepo.find({ where: { userId } });
-  }
+  async findAll(userId: string): Promise<ShoppingList[]> {}
 
   async create(userId: string, dto: CreateShoppingItemDto): Promise<ShoppingList> {
killedBy: ShoppingListService findAll should return an array of shopping items for specific user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [{"id": "1", "name": "Milk", "userId": "user-123"}]
Received: undefined

[Killed] BlockStatement
src/shopping-list/shopping-list.service.ts:22:83
     return this.shoppingListRepo.find({ where: { userId } });
   }
 
-  async create(userId: string, dto: CreateShoppingItemDto): Promise<ShoppingList> {
-    const newItem = this.shoppingListRepo.create({
-      userId,
-      name: dto.name,
-      quantity: dto.quantity,
-      unit: dto.unit,
-      category: dto.category || 'Інше',
-      productId: null,
-    });
-
-    return this.shoppingListRepo.save(newItem);
-  }
+  async create(userId: string, dto: CreateShoppingItemDto): Promise<ShoppingList> {}
 
   async delete(userId: string, id: string): Promise<void> {
killedBy: ShoppingListService create should create and save a new item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"category": "Інше", "id": "new-id", "name": "Bread", "productId": null, "quantity": 1, "unit": "шт", "userId": "user-123"}
Received: undefined

[Survived] ObjectLiteral
src/shopping-list/shopping-list.service.ts:23:50
   }
 
   async create(userId: string, dto: CreateShoppingItemDto): Promise<ShoppingList> {
-    const newItem = this.shoppingListRepo.create({
-      userId,
-      name: dto.name,
-      quantity: dto.quantity,
-      unit: dto.unit,
-      category: dto.category || 'Інше',
-      productId: null,
-    });
+    const newItem = this.shoppingListRepo.create({});
 
     return this.shoppingListRepo.save(newItem);

[Survived] ConditionalExpression
src/shopping-list/shopping-list.service.ts:28:17
       name: dto.name,
       quantity: dto.quantity,
       unit: dto.unit,
-      category: dto.category || 'Інше',
+      category: true,
       productId: null,
     });

[Survived] LogicalOperator
src/shopping-list/shopping-list.service.ts:28:17
       name: dto.name,
       quantity: dto.quantity,
       unit: dto.unit,
-      category: dto.category || 'Інше',
+      category: dto.category && 'Інше',
       productId: null,
     });

[Killed] BlockStatement
src/shopping-list/shopping-list.service.ts:35:59
     return this.shoppingListRepo.save(newItem);
   }
 
-  async delete(userId: string, id: string): Promise<void> {
-    await this.shoppingListRepo.delete({ id, userId });
-  }
+  async delete(userId: string, id: string): Promise<void> {}
 
   async completeShopping(userId: string, dto: CompleteShoppingDto) {
killedBy: ShoppingListService delete should delete item by id and userId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": "item-1", "userId": "user-123"}

Number of calls: 0

[Killed] BlockStatement
src/shopping-list/shopping-list.service.ts:39:68
     await this.shoppingListRepo.delete({ id, userId });
   }
 
-  async completeShopping(userId: string, dto: CompleteShoppingDto) {
-    const { ids } = dto;
-    let movedCount = 0;
-    const itemsToMove = await this.shoppingListRepo.find({
-      where: {
-        userId,
-        id: In(ids),
-      },
-    });
-
-    for (const item of itemsToMove) {
-      await this.pantryService.addItem(userId, {
-        name: item.name,
-        quantity: item.quantity,
-        unit: item.unit as UnitType,
-        category: item.category,
-      });
-
-      await this.shoppingListRepo.delete(item.id);
-      movedCount++;
-    }
-
-    return { count: movedCount };
-  }
+  async completeShopping(userId: string, dto: CompleteShoppingDto) {}
 }
 
killedBy: ShoppingListService completeShopping should move items to pantry and delete from shopping list
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
src/shopping-list/shopping-list.service.ts:42:58
   async completeShopping(userId: string, dto: CompleteShoppingDto) {
     const { ids } = dto;
     let movedCount = 0;
-    const itemsToMove = await this.shoppingListRepo.find({
-      where: {
-        userId,
-        id: In(ids),
-      },
-    });
+    const itemsToMove = await this.shoppingListRepo.find({});
 
     for (const item of itemsToMove) {

[Survived] ObjectLiteral
src/shopping-list/shopping-list.service.ts:43:14
     const { ids } = dto;
     let movedCount = 0;
     const itemsToMove = await this.shoppingListRepo.find({
-      where: {
-        userId,
-        id: In(ids),
-      },
+      where: {},
     });
 

[Killed] BlockStatement
src/shopping-list/shopping-list.service.ts:49:37
       },
     });
 
-    for (const item of itemsToMove) {
-      await this.pantryService.addItem(userId, {
-        name: item.name,
-        quantity: item.quantity,
-        unit: item.unit as UnitType,
-        category: item.category,
-      });
-
-      await this.shoppingListRepo.delete(item.id);
-      movedCount++;
-    }
+    for (const item of itemsToMove) {}
 
     return { count: movedCount };
killedBy: ShoppingListService completeShopping should move items to pantry and delete from shopping list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] UpdateOperator
src/shopping-list/shopping-list.service.ts:58:7
       });
 
       await this.shoppingListRepo.delete(item.id);
-      movedCount++;
+      movedCount--;
     }
 

[Survived] ObjectLiteral
src/shopping-list/shopping-list.service.ts:61:12
       movedCount++;
     }
 
-    return { count: movedCount };
+    return {};
   }
 }
